{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-LAW",
    "2": "I-LAW",
    "3": "B-PENALTY",
    "4": "I-PENALTY",
    "5": "B-AMOUNT",
    "6": "I-AMOUNT",
    "7": "B-DATE",
    "8": "I-DATE",
    "9": "B-ORG",
    "10": "I-ORG",
    "11": "B-CRIME",
    "12": "I-CRIME"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-AMOUNT": 5,
    "B-CRIME": 11,
    "B-DATE": 7,
    "B-LAW": 1,
    "B-ORG": 9,
    "B-PENALTY": 3,
    "I-AMOUNT": 6,
    "I-CRIME": 12,
    "I-DATE": 8,
    "I-LAW": 2,
    "I-ORG": 10,
    "I-PENALTY": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "tie_word_embeddings": true,
  "tokenizer_class": "BertTokenizer",
  "transformers_version": "5.5.4",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 32000
}
